In [1]:
import pandas as pd

## Group by - Basic

In [2]:
# data from: 
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
         'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
         'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
         'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
         'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}

df = pd.DataFrame(ipl_data)
df

    Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
2      863     2  Devils  2014
3      673     3  Devils  2015
4      741     3   Kings  2014
5      812     4   kings  2015
6      756     1   Kings  2016
7      788     1   Kings  2017
8      694     2  Riders  2016
9      701     4  Royals  2014
10     804     1  Royals  2015
11     690     2  Riders  2017

In [4]:
df["Team"].unique()

array(['Riders', 'Devils', 'Kings', 'kings', 'Royals'], dtype=object)

In [6]:
df.groupby("Team")["Points"].sum()

Team
Devils    1536
Kings     2285
Riders    3049
Royals    1505
kings      812
Name: Points, dtype: int64

In [7]:
df.groupby("Team")["Points"].sum().tolist()

[1536, 2285, 3049, 1505, 812]

In [8]:
h_index = df.groupby(["Team", "Year"])["Points"].sum()
h_index

Team    Year
Devils  2014    863
        2015    673
Kings   2014    741
        2016    756
        2017    788
Riders  2014    876
        2015    789
        2016    694
        2017    690
Royals  2014    701
        2015    804
kings   2015    812
Name: Points, dtype: int64

In [9]:
h_index.index

MultiIndex(levels=[['Devils', 'Kings', 'Riders', 'Royals', 'kings'], [2014, 2015, 2016, 2017]],
           labels=[[0, 0, 1, 1, 1, 2, 2, 2, 2, 3, 3, 4], [0, 1, 0, 2, 3, 0, 1, 2, 3, 0, 1, 1]],
           names=['Team', 'Year'])

In [11]:
h_index.unstack().fillna(0)

Year     2014   2015   2016   2017
Team
Devils  863.0  673.0    0.0    0.0
Kings   741.0    0.0  756.0  788.0
Riders  876.0  789.0  694.0  690.0
Royals  701.0  804.0    0.0    0.0
kings     0.0  812.0    0.0    0.0

In [13]:
h_index.swaplevel().sort_index(level=0)

Year  Team
2014  Devils    863
      Kings     741
      Riders    876
      Royals    701
2015  Devils    673
      Riders    789
      Royals    804
      kings     812
2016  Kings     756
      Riders    694
2017  Kings     788
      Riders    690
Name: Points, dtype: int64

In [15]:
h_index

Team    Year
Devils  2014    863
        2015    673
Kings   2014    741
        2016    756
        2017    788
Riders  2014    876
        2015    789
        2016    694
        2017    690
Royals  2014    701
        2015    804
kings   2015    812
Name: Points, dtype: int64

In [14]:
h_index.sum(level=0)

Team
Devils    1536
Kings     2285
Riders    3049
Royals    1505
kings      812
Name: Points, dtype: int64

In [16]:
h_index.sum(level=1)

Year
2014    3181
2015    3078
2016    1450
2017    1478
Name: Points, dtype: int64

### Groupby - grouped

In [17]:
grouped = df.groupby("Team")

In [19]:
for data in grouped:
    print(data)

('Devils',    Points  Rank    Team  Year
2     863     2  Devils  2014
3     673     3  Devils  2015)
('Kings',    Points  Rank   Team  Year
4     741     3  Kings  2014
6     756     1  Kings  2016
7     788     1  Kings  2017)
('Riders',     Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
8      694     2  Riders  2016
11     690     2  Riders  2017)
('Royals',     Points  Rank    Team  Year
9      701     4  Royals  2014
10     804     1  Royals  2015)
('kings',    Points  Rank   Team  Year
5     812     4  kings  2015)

In [20]:
for name, group in grouped:
    print(name)
    print(group)

Devils
   Points  Rank    Team  Year
2     863     2  Devils  2014
3     673     3  Devils  2015
Kings
   Points  Rank   Team  Year
4     741     3  Kings  2014
6     756     1  Kings  2016
7     788     1  Kings  2017
Riders
    Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
8      694     2  Riders  2016
11     690     2  Riders  2017
Royals
    Points  Rank    Team  Year
9      701     4  Royals  2014
10     804     1  Royals  2015
kings
   Points  Rank   Team  Year
5     812     4  kings  2015

In [21]:
for name, group in grouped:
    print(type(name))
    print(type(group))

<class 'str'>
<class 'pandas.core.frame.DataFrame'>
<class 'str'>
<class 'pandas.core.frame.DataFrame'>
<class 'str'>
<class 'pandas.core.frame.DataFrame'>
<class 'str'>
<class 'pandas.core.frame.DataFrame'>
<class 'str'>
<class 'pandas.core.frame.DataFrame'>

In [22]:
grouped.get_group('Riders')

    Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
8      694     2  Riders  2016
11     690     2  Riders  2017

### Aggregation - 요약된 통계 정보를 추출해줌

In [23]:
grouped.agg(sum)

        Points  Rank  Year
Team
Devils    1536     5  4029
Kings     2285     5  6047
Riders    3049     7  8062
Royals    1505     5  4029
kings      812     4  2015

In [24]:
grouped.agg(min)

        Points  Rank  Year
Team
Devils     673     2  2014
Kings      741     1  2014
Riders     690     1  2014
Royals     701     1  2014
kings      812     4  2015

In [25]:
grouped.agg(max)

        Points  Rank  Year
Team
Devils     863     3  2015
Kings      788     3  2017
Riders     876     2  2017
Royals     804     4  2015
kings      812     4  2015

In [31]:
import numpy as np
grouped.agg(np.mean)

            Points      Rank         Year
Team
Devils  768.000000  2.500000  2014.500000
Kings   761.666667  1.666667  2015.666667
Riders  762.250000  1.750000  2015.500000
Royals  752.500000  2.500000  2014.500000
kings   812.000000  4.000000  2015.000000

In [34]:
grouped.agg([np.sum, np.mean, np.std])

       Points                         Rank                      Year  \
          sum        mean         std  sum      mean       std   sum
Team
Devils   1536  768.000000  134.350288    5  2.500000  0.707107  4029
Kings    2285  761.666667   24.006943    5  1.666667  1.154701  6047
Riders   3049  762.250000   88.567771    7  1.750000  0.500000  8062
Royals   1505  752.500000   72.831998    5  2.500000  2.121320  4029
kings     812  812.000000         NaN    4  4.000000       NaN  2015


               mean       std
Team
Devils  2014.500000  0.707107
Kings   2015.666667  1.527525
Riders  2015.500000  1.290994
Royals  2014.500000  0.707107
kings   2015.000000       NaN

In [36]:
grouped["Points"].agg([np.sum, np.mean, np.std]).fillna(0)

         sum        mean         std
Team
Devils  1536  768.000000  134.350288
Kings   2285  761.666667   24.006943
Riders  3049  762.250000   88.567771
Royals  1505  752.500000   72.831998
kings    812  812.000000    0.000000

### Transformation - 해당 정보를 변환해줌

In [40]:
score = lambda x: (x - x.mean()) / x.std()
grouped.transform(lambda x: (x - x.mean()) / x.std())

      Points      Rank      Year
0   1.284327 -1.500000 -1.161895
1   0.302029  0.500000 -0.387298
2   0.707107 -0.707107 -0.707107
3  -0.707107  0.707107  0.707107
4  -0.860862  1.154701 -1.091089
5        NaN       NaN       NaN
6  -0.236043 -0.577350  0.218218
7   1.096905 -0.577350  0.872872
8  -0.770596  0.500000  0.387298
9  -0.707107  0.707107 -0.707107
10  0.707107 -0.707107  0.707107
11 -0.815759  0.500000  1.161895

In [42]:
df

    Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
2      863     2  Devils  2014
3      673     3  Devils  2015
4      741     3   Kings  2014
5      812     4   kings  2015
6      756     1   Kings  2016
7      788     1   Kings  2017
8      694     2  Riders  2016
9      701     4  Royals  2014
10     804     1  Royals  2015
11     690     2  Riders  2017

In [41]:
df.groupby('Team').filter(lambda x: len(x) >= 3)

    Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
4      741     3   Kings  2014
6      756     1   Kings  2016
7      788     1   Kings  2017
8      694     2  Riders  2016
11     690     2  Riders  2017

In [43]:
df.groupby('Team').filter(lambda x: x["Points"].min() > 800)

   Points  Rank   Team  Year
5     812     4  kings  2015

In [44]:
df.groupby('Team').filter(lambda x: x["Points"].max() > 800)

    Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
2      863     2  Devils  2014
3      673     3  Devils  2015
5      812     4   kings  2015
8      694     2  Riders  2016
9      701     4  Royals  2014
10     804     1  Royals  2015
11     690     2  Riders  2017